{
  "title": "Minimalist Duplex in the Heart of Historic Kazimierz Dolny",
  "description": "Step inside this sunlit, Scandinavian-style duplex that offers timeless simplicity and everyday warmth. The thoughtfully designed 135 sqm layout features a seamless flow between the airy living space—with a refined fireplace as its focal point—and a modern, accessible kitchen. Three serene bedrooms and three bathrooms ensure comfort and privacy for residents and visitors alike. Architectural details reflect both traditional craftsmanship and calming minimalist ethos, offering the perfect blend of style and convenience in every corner.",
  "neighborhood_description": "Nestled in Rynek, amidst the cobblestone charm of Kazimierz Dolny, this duplex enjoys proximity to the town's iconic main square. Embraced by a quiet atmosphere and abundant historic allure, residents benefit from peaceful surroundings and excellent highway access—ideal for commuters. Enjoy tranquil walks amid historic facades while savoring all the advantages of this picturesque riverside haven.",
  "bedrooms": 3,
  "bathrooms": 3,
  "size_sqm": 135,
  "property_type": "duplex",
  "city": "Kazimierz Dolny",
  "neighborhood": "Rynek",
  "urban_level": "low",
  "transport_options": [
    "highway"
  ],
  "price": 1480000,
  "key_features": [
    "wheelchair accessibility",
    "fenced yard",
    "fireplace",
    "well-maintained common areas",
    "dedicated parking space"
  ],
  "lifestyle_benefits": [
    "peaceful work-from-home environment",
    "quick highway access for commuters",
    "historic residential ambiance",
    "privacy with secured yard",
    "minimalist Scandinavian interiors"
  ],
  "target_buyer": "Ideally suited for professionals seeking an elegant, workspace-ready residence outside the urban bustle, offering comfort, accessibility, and privacy.",
  "market_positioning": "An exclusive, move-in ready duplex that harmonizes Scandinavian design sensibilities with the subtle, enduring beauty of Kazimierz Dolny’s storied core. Perfectly positions for discerning buyers prioritizing work-life balance, accessibility, and heritage appeal."
}