{
  "title": "Minimalist Scandinavian Duplex in Artist-Friendly Kazimierz Dolny",
  "description": "A stylish and spacious duplex offering clean lines, open, light-filled living spaces, and natural materials throughout. This home features 4 comfortable bedrooms and 3 minimalist-inspired bathrooms. Meticuloulsy designed to create an inviting ambiance, its functional kitchen and large windows inspire everyday creativity. Underfloor heating and thoughtful sustainable features emphasize both comfort and simplicity.",
  "neighborhood_description": "Nestled on Rynek in Kazimierz Dolny, this property sits at the heart of a growing, creative neighborhood. Experience inspiration all around—close to galleries, artisanal cafes and the business district, with peaceful, leafy streets just steps from shopping and dining. Proximity to key highways makes regional travel effortless, ideal for those who blend studio and home life.",
  "bedrooms": 4,
  "bathrooms": 3,
  "size_sqm": 165,
  "property_type": "duplex",
  "city": "Kazimierz Dolny",
  "neighborhood": "Rynek",
  "urban_level": "low",
  "transport_options": [
    "highway"
  ],
  "price": 1260000,
  "key_features": [
    "children's playground area",
    "underfloor heating",
    "guest bathroom",
    "rainwater collection system",
    "shopping and dining nearby"
  ],
  "lifestyle_benefits": [
    "Ideal for artists and creatives",
    "Access to green and tranquil surroundings",
    "Easy highway connectivity",
    "Moments from galleries and creative spaces",
    "Comfortable and stylish for work-life balance"
  ],
  "target_buyer": "Perfect for artists, designers and creative families seeking an airy, inspiring home with convenient access to both nature and modern amenities in a quiet but developing community.",
  "market_positioning": "Distinctive in its blend of minimalist architecture and artist-friendly ambiance, this duplex sets itself apart in Kazimierz Dolny’s Rynek as a rare contemporary offering for buyers looking for space, inspiration, and growth in an iconic and creative setting."
}