{
  "title": "Historic Old Town Duplex: Period Elegance with Modern Comfort",
  "description": "Discover this enchanting duplex in the heart of Krosno's storied Old Town. Offering 5 spacious bedrooms and 2 classic bathrooms across a generous 197 sqm, this residence blends historic architectural charm with contemporary accessibility. Panoramic windows flood the living areas with light and invite picturesque views of the charming town surrounds. Practicality meets tradition with a guest bathroom on the main floor, subtle preservation of original detailing, and a thoughtfully integrated plan designed for easy movement, including wheelchair accessibility.",
  "neighborhood_description": "Nestled among cobbled lanes and colorful townhouses, Old Town in Krosno radiates a peaceful, artistic energy. The locale is favored by the creative community and growing families, with convenient access to local schools and boutique galleries. Seamless highway connections put both tranquil nature escapes and business zones within easy reach.",
  "bedrooms": 5,
  "bathrooms": 2,
  "size_sqm": 197,
  "property_type": "duplex",
  "city": "Krosno",
  "neighborhood": "Old Town",
  "urban_level": "low",
  "transport_options": [
    "highway"
  ],
  "price": 1425000,
  "key_features": [
    "guest bathroom",
    "wheelchair accessibility",
    "panoramic windows",
    "original architectural details",
    "generous living areas"
  ],
  "lifestyle_benefits": [
    "historic character for creative expression",
    "peaceful atmosphere surrounded by artistic community",
    "proximity to schools, shops, and green spaces",
    "comfortable multi-generational living options"
  ],
  "target_buyer": "Ideal for young couples seeking historic elegance with flexible space to live, create, host, and expand their family within a stimulating yet peaceful neighborhood.",
  "market_positioning": "Uniquely positioned among historic residences, this duplex delivers authentic Old Town character⁠—enhanced by rare layout versatility and accessibility, an exceptional match for Krosno's discerning buyers who value heritage with thoughtful modern updates."
}