{
  "title": "Minimalist Scandinavian Retreat Steps from Kazimierz Dolny’s Rynek",
  "description": "Discover Scandinavian-inspired living in this beautifully designed 175 sqm, four-bedroom house. Large windows flood the open plan interior living spaces with light, accentuating the minimalist aesthetic and natural hardwood floors. Three modern bathrooms provide privacy and comfort, while an eco-conscious touch is added by efficient solar panels and an elegant contemporary façade.\nPets are warmly welcomed, and every detail from design to layout is curated for ease, flexibility, and style.",
  "neighborhood_description": "Set on Rynek, Kazimierz Dolny’s historic yet trendy heart, daily life perfectly balances vibrancy and peace. Delight in eclectic shopping, bistro dining experiences, and the safety of a beloved community, all a short walk from your door. Residents benefit from easy highway access for convenient regional travels, ideal for professionals on the move.",
  "bedrooms": 4,
  "bathrooms": 3,
  "size_sqm": 175,
  "property_type": "house",
  "city": "Kazimierz Dolny",
  "neighborhood": "Rynek",
  "urban_level": "low",
  "transport_options": [
    "highway"
  ],
  "price": 1640000,
  "key_features": [
    "solar panels",
    "hardwood floors",
    "modern façade design",
    "pets allowed",
    "open-plan living",
    "large windows"
  ],
  "lifestyle_benefits": [
    "walkable access to shopping and dining",
    "move-in ready for relocating professionals",
    "safe neighborhood",
    "quiet and modern intimacy while being near town activity"
  ],
  "target_buyer": "Ideal for relocating professionals seeking a stylish family home with sustainability features, close to market square conveniences in a highly desirable Polish town.",
  "market_positioning": "A rare modern minimalist sanctuary within Kazimierz Dolny’s historical core, this home positions itself as the go-to for discerning buyers needing both transport convenience and an inspiring, ready-to-enjoy space."
}