{
  "title": "Minimalist Scandinavian Retreat in Krosno Old Town",
  "description": "Enjoy understated elegance in this newly built Scandinavian-inspired house, offering 3 serene bedrooms and 3 streamlined bathrooms across a generous 154 sqm. The heart of the home is a minimalist, modern kitchen opening onto a bright dining area framed by panoramic windows. Flexible, open spaces—including a dedicated co-working loft—favor calm, comfort, and creativity. Low-impact sustainable touches like a rainwater collection system and energy-efficient surfaces blend quietly into daily living.",
  "neighborhood_description": "Situated in Krosno’s charming Old Town, this property bridges tranquil village character with modern convenience. Wide, leafy streets and quaint squares lead to nearby parks and peaceful playgrounds, ideal for strolls and relaxed days. The neighborhood benefits from easy highway access for simple journeys in and out of Krosno, as well as proximity to essential amenities such as local grocers and respected schools enclaved nearby.",
  "bedrooms": 3,
  "bathrooms": 3,
  "size_sqm": 154,
  "property_type": "house",
  "city": "Krosno",
  "neighborhood": "Old Town",
  "urban_level": "low",
  "transport_options": [
    "highway"
  ],
  "price": 1349000,
  "key_features": [
    "outdoor dining area",
    "modern Scandinavian kitchen",
    "panoramic windows",
    "co-working loft space",
    "rainwater collection system",
    "fenced private yard"
  ],
  "lifestyle_benefits": [
    "superb tranquility for restful retirement",
    "abundant natural light and green views",
    "accessible scenic parks and walkways",
    "opportunities for productive remote work"
  ],
  "target_buyer": "Ideal for retirees or empty nesters seeking a tranquil, contemporary refuge with space for hobbies, remote work, or visits from family.",
  "market_positioning": "With thoughtful design and sustainable amenities, this property presents a rare minimalist Scandinavian home in one of Krosno's most tranquil Old Town locations—perfectly matched to discerning retirees valuing peace, comfort, and sustainability."
}