{
  "title": "Historic 3-Bedroom Artistic Retreat with Modern Touches in Dyrekcja",
  "description": "Step into a unique blend of history and creativity: this 3-bedroom, 2-bathroom apartment in Chelm’s Dyrekcja neighborhood beckons with original period features and mindful modern upgrades. With 98 sqm of spacious interiors including an open home office, there's plenty of natural light to fuel your inspiration. Residents enjoy seamless indoor-outdoor living thanks to a welcoming shared courtyard, ideal for quiet mornings with your sketchbook or lively conversation with neighbors. The home boasts a modern lighting system and eco-friendly details for low-stress, contemporary living.",
  "neighborhood_description": "Situated in the tranquil Dyrekcja area of Chelm, this residence is at the meeting point of an emerging artistic enclave and a relaxed pace of life. The streets invite intimate community gatherings and creative cooperation, offering a haven from the bustle yet close to Chelm’s business district conveniences. With highway access nearby, regional excursions, supplies runs, and gallery visits are always an easy ride away.",
  "bedrooms": 3,
  "bathrooms": 2,
  "size_sqm": 98,
  "property_type": "apartment",
  "city": "Chelm",
  "neighborhood": "Dyrekcja",
  "urban_level": "low",
  "transport_options": [
    "highway"
  ],
  "price": 820000,
  "key_features": [
    "shared courtyard",
    "recycling facilities",
    "home office space",
    "motion-sensor exterior lights",
    "modern lighting system"
  ],
  "lifestyle_benefits": [
    "creative neighbors",
    "quiet for focused work",
    "walkable to artisan shops and cafés",
    "balanced pace of life"
  ],
  "target_buyer": "Ideal for artists and creatives seeking a tranquil and character-filled home that offers both solitude and access to a like-minded community. The home suits anyone desiring flexible work-live space, historic appeal, and a sustainable lifestyle.",
  "market_positioning": "This beautiful property stands apart in Dyrekcja for its harmonious blend of old-world charm and modern amenities. Priced decidedly within the mid-market range for Chelm, it offers unbeatable value for creative professionals and visionary homeowners seeking inspiration without compromise."
}