{
  "title": "Light-Filled Scandinavian House with Terrace in Stare Miasto",
  "description": "Nestled in Zamosc's historic Stare Miasto, this five-bedroom minimalist house pairs modern Scandinavian design with the area's centuries-old ambience. The spacious 220 sqm interior is anchored by a natural-light-fed living area, soft-toned wooden floors, and sleek built-in storage. Two tranquil bathrooms, including a private master ensuite, accompany flexible bedrooms arranged for both work and rest. Flow seamlessly onto a private terrace—perfect for quiet coffee breaks or remote work sessions.",
  "neighborhood_description": "Stare Miasto is renowned for its charming cobbled squares, inviting community spirit, and abundant shopping and dining options a short stroll away. Its medium urban energy is well-matched with green parks for walking and rec leisure, encouraging an active, engaging lifestyle beyond your door. Reliable public transport and direct highway connections link you easily to the rest of Zamosc and beyond.",
  "bedrooms": 5,
  "bathrooms": 2,
  "size_sqm": 220,
  "property_type": "house",
  "city": "Zamosc",
  "neighborhood": "Stare Miasto",
  "urban_level": "medium",
  "transport_options": [
    "public transport",
    "highway"
  ],
  "price": 1670000,
  "key_features": [
    "ensuite bathroom",
    "spacious terrace",
    "minimalist built-in storage",
    "large windows for natural light",
    "proximity to shops and cafés"
  ],
  "lifestyle_benefits": [
    "quiet yet connected environment conducive to remote working",
    "walking distance to cafés and community activities",
    "ample home office options",
    "inspiring historical surroundings"
  ],
  "target_buyer": "Remote workers or families seeking a serene, contemporary home designed for work-life balance in the heart of a storied Polish city.",
  "market_positioning": "Strategically positioned for those valuing culture, community, and flexible work environments. A unique blend of modern comfort and historic charm attracts discerning buyers seeking space, style, and connection."
}