{
  "title": "Loft Living with Historic Flair: 3-Bedroom Oasis in Zaspa, Gdansk",
  "description": "Step into this striking loft that harmoniously blends the area’s historical charm with modern comforts. Offering three spacious bedrooms and one tastefully appointed bathroom, this residence covers a generous 98 sqm—perfect for both couples and families welcoming a little extra space. High ceilings and large arched windows illuminate the open-plan living area, while original brickwork and beams pay homage to the building’s legacy. The terrace beckons for sun-filled mornings, and built-in accessibility ensures ease of movement throughout the home.",
  "neighborhood_description": "Located in the vibrant Zaspa district of Gdansk, you’ll enjoy a neighborhood renowned for its green spaces and an active, pet-friendly, outdoor lifestyle. Residents benefit from extensive bike paths, public parks ideal for walks or play, and the convenience of great public transport connections. This area is rapidly evolving with new amenities and nurturing a close-knit, eco-conscious community vibe marked by its proximity to excellent schools, cafes, and markets.",
  "bedrooms": 3,
  "bathrooms": 1,
  "size_sqm": 98,
  "property_type": "loft",
  "city": "Gdansk",
  "neighborhood": "Zaspa",
  "urban_level": "medium",
  "transport_options": [
    "public transport",
    "bike lines"
  ],
  "price": 1160000,
  "key_features": [
    "historical building features",
    "home office space",
    "sunny terrace",
    "open-plan living area",
    "wheelchair accessibility"
  ],
  "lifestyle_benefits": [
    "perfect for pet owners with nearby green areas",
    "ideal for active lifestyles with many walking and cycling paths",
    "walkable access to local schools, shops, and cafes",
    "warm and growing neighborhood community"
  ],
  "target_buyer": "This property is ideal for pet owners, families with active lifestyles, or anyone seeking historic character without sacrificing accessibility and proximity to nature.",
  "market_positioning": "A rare opportunity in Zaspa, this loft offers historic charm fused with modern necessities, positioned competitively for buyers looking for space, authenticity, and community amenities in Gdansk's dynamic property market."
}