{
  "title": "Historic Charm with Modern Comforts in Zamosc Old Town",
  "description": "Welcome to a grand 4-bedroom, 2-bathroom apartment that merges classic elegance with modern convenience in the heart of Zamosc's Stare Miasto. Set over 132 sqm, this spacious apartment offers high ceilings and restored original floors complemented by underfloor heating for luxurious comfort. Step onto your sunlit terrace or glide peacefully through the underground garage, all within a character-rich 19th-century building. Storage needs are met effortlessly with a generous walk-in closet, and inhabitants enjoy a tranquil, shared courtyard.",
  "neighborhood_description": "Stare Miasto, or Old Town, known for its Renaissance layout and welcoming boulevards, now blends thoughtfully restored architecture with a modern development spirit. The growing neighborhood supports families and professionals alike, offering ready access to public transport, nearby highways, local shops, and fresh green spaces set against picturesque scenes with glimpses of distant hills. Every stroll connects you to history, vibrant streets, and community events that embrace modern urban lifestyles while retaining a unique historic charm.",
  "bedrooms": 4,
  "bathrooms": 2,
  "size_sqm": 132,
  "property_type": "apartment",
  "city": "Zamosc",
  "neighborhood": "Stare Miasto",
  "urban_level": "medium",
  "transport_options": [
    "public transport",
    "highway"
  ],
  "price": 1080000,
  "key_features": [
    "underfloor heating",
    "underground garage",
    "walk-in closet",
    "shared courtyard",
    "terrace",
    "high ceilings",
    "historic building"
  ],
  "lifestyle_benefits": [
    "ample pet-friendly outdoor areas in the courtyard and nearby parks",
    "quiet terrace perfect for relaxing with pets",
    "generous living space for multiple residents or furry friends",
    "walkable neighborhood with easy pet walks"
  ],
  "target_buyer": "Ideal for pet owners and families who appreciate historical character blended with contemporary standards, seeking a spacious home close to amenities and green spaces in a lively, cultural neighborhood.",
  "market_positioning": "Positioned as a rare blend of classic Old Town allure and new-build function, this property attracts discerning buyers wanting uncompromised space and modern appointments—an exceptional and pet-friendly find in Zamosc's prestigious heritage quarters."
}