{
  "title": "Eco-Chic Artist Loft with Park Views in Katowice Śródmieście",
  "description": "This stylish, sun-drenched loft offers an open floor plan with statement hardwood floors and soaring ceilings, ideal for creating, living, and inspiring. Boasting two spacious bedrooms and two modern bathrooms, the space has a flexible layout to adapt to your artistic or professional needs. Express your creativity within these eco-conscious, pet-friendly walls, filled with natural light and authentic flair.",
  "neighborhood_description": "Located in the vibrant heart of Śródmieście, you are just steps away from charming parks, cultural venues, galleries, and playgrounds—blending the buzz of city life with pockets of tranquil green. The area supports a balanced lifestyle, offering boutique cafés, local shops, and artisan spaces. Seamlessly connected by extensive public transport and organized bike lines, your daily commute or exploration will be both green and effortless.",
  "bedrooms": 2,
  "bathrooms": 2,
  "size_sqm": 97,
  "property_type": "loft",
  "city": "Katowice",
  "neighborhood": "Śródmieście",
  "urban_level": "high",
  "transport_options": [
    "public transport",
    "bike lines"
  ],
  "price": 1290000,
  "key_features": [
    "pets allowed",
    "hardwood floors",
    "open floor plan",
    "large industrial windows",
    "modern kitchen",
    "energy-efficient lighting"
  ],
  "lifestyle_benefits": [
    "perfect art studio possibilities",
    "eco-friendly, sustainable space",
    "park access steps away",
    "walkable to vibrant cafés and galleries",
    "bicycle-friendly neighborhood"
  ],
  "target_buyer": "Ideal for artists, designers, and creative urban dwellers seeking a distinctive, environmentally-aware home in the city’s émergent arts hub.",
  "market_positioning": "Positioned as a rare, contemporary loft with true industrial character, this home stands out within Katowice's property market for its eco-conscious detailing and adaptability—perfect for buyers valuing uniqueness, centrality, and a creative lifestyle."
}