{
  "title": "Bright 3-Bed Duplex Retreat with Courtyard in Vibrant Port District",
  "description": "Experience coastal living in this spacious 3-bedroom, 2-bathroom duplex, offering 120 sqm of thoughtfully designed space. Flooded with natural light, this property features generous bedrooms, modern bathrooms, and a cozy open-plan living area perfect for gatherings. Relax in your own private section within a well-cared-for building showcasing well-maintained common areas and a stylish reception desk, ensuring convenience and security.\n",
  "neighborhood_description": "Located in Ustka's Port District, this home places you amid a vibrant mix of historic charm and lively local culture. The area is known for its coastal appeal, community markets, and colorful dining spots—all steps away from your door. With bicycle paths and direct highway access, you're always well-connected, while enjoying the laid-back, residential ambiance of a low-urban neighborhood.",
  "bedrooms": 3,
  "bathrooms": 2,
  "size_sqm": 120,
  "property_type": "duplex",
  "city": "Ustka",
  "neighborhood": "Port District",
  "urban_level": "low",
  "transport_options": [
    "highway",
    "bike lines"
  ],
  "price": 1280000,
  "key_features": [
    "well-maintained common areas",
    "reception desk",
    "shared courtyard",
    "modern interior design",
    "spacious layout",
    "secure building"
  ],
  "lifestyle_benefits": [
    "quiet, relaxed pace living",
    "easy access to beaches",
    "walk to local markets and cafés",
    "excellent bike paths for daily rides",
    "active cultural community"
  ],
  "target_buyer": "Ideal for retirees seeking an active-yet-laid-back coastal lifestyle, or young professionals desiring flexible, modern living in a unique cultural district with easy transport connections.",
  "market_positioning": "Positioned as a premium option in Ustka's property market for those prioritizing secure, comfortable living and proximity to vibrant local amenities, this duplex stands out for its balance of modern features, ample space, and community atmosphere in the most dynamic part of the Port District."
}