{
  "title": "Serene Scandinavian Loft with Artistic Vibe in Dyrekcja, Chełm",
  "description": "This minimalist, newly renovated loft offers an expansive open floor plan drenched in natural light. Crisp, white walls balance warm hardwood floors, creating a peaceful, clutter-free atmosphere perfect for creativity. Featuring one spacious bedroom and a sleek bathroom, the space is cooled by efficient air conditioning, designed for comfort with understated elegance.",
  "neighborhood_description": "Nestled in the tranquil Dyrekcja neighborhood of Chełm, renowned for its welcoming artistic community. The area is quiet and inspiring, with local studios and galleries easily accessible, and remains close to essential amenities including nearby schools. Ideal for those seeking inspiration away from the city's bustle yet wishing for easy connections by highway.",
  "bedrooms": 1,
  "bathrooms": 1,
  "size_sqm": 56,
  "property_type": "loft",
  "city": "Chełm",
  "neighborhood": "Dyrekcja",
  "urban_level": "low",
  "transport_options": [
    "highway"
  ],
  "price": 995000,
  "key_features": [
    "air conditioning",
    "open floor plan",
    "newly renovated interior",
    "hardwood floors",
    "natural light",
    "spacious living area"
  ],
  "lifestyle_benefits": [
    "peaceful surroundings for focused work or creativity",
    "space ideal for setting up a studio or workshop",
    "uplifting aesthetic for mindful living",
    "keen sense of community among local artists"
  ],
  "target_buyer": "An artist, designer, or creative professional seeking a calm, inspirational living and working space away from urban distractions.",
  "market_positioning": "A unique offering in the local market, this loft stands out for its contemporary, move-in-ready design with distinctive Scandinavian appeal. One of the few newly renovated open-plan spaces at this price point in Chelm, it caters specifically to creative individuals seeking both seclusion and artistic connection."
}