{
  "title": "Chic Studio with Historic Flair in Heart of Górna",
  "description": "Experience classic Lodz charm in this beautifully renovated studio, seamlessly blending vintage elegance with modern convenience. The sun-filled living space offers a cozy yet flexible layout, perfect for productive days or relaxing evenings. Enjoy features such as high ceilings and restored architectural details alongside a state-of-the-art guest bathroom and all-new fixtures throughout. With studio living enhanced by chic, contemporary renovations, this property makes smart use of its compact footprint of 34 sqm.",
  "neighborhood_description": "Set in the Górna district, this studio sits just minutes from Lodz's cultural heart while being surrounded by historic facades and vibrant streets. Residents enjoy easy access to creative coworking spaces, coffee spots, and galleries, all just a pleasant stroll or bike ride away. Excellent public transportation and bike lines ensure connectivity throughout the city.",
  "bedrooms": 1,
  "bathrooms": 1,
  "size_sqm": 34,
  "property_type": "studio/apartment",
  "city": "Lodz",
  "neighborhood": "Gorna",
  "urban_level": "medium",
  "transport_options": [
    "public transport",
    "bike lines"
  ],
  "price": 367000,
  "key_features": [
    "newly renovated interior",
    "guest bathroom",
    "access to resident swimming pool",
    "high ceilings",
    "large windows"
  ],
  "lifestyle_benefits": [
    "inspiring work-from-home atmosphere",
    "easy access to city center",
    "surrounded by galleries, cafes, and innovation hubs"
  ],
  "target_buyer": "Ideal for entrepreneurial young professionals or digital creatives searching for inspirational compact city living with classical character steps from Lodz’s cultural pulse.",
  "market_positioning": "A rare move-in-ready studio offering sought-after historic vibes and communal amenities in a desirable, growing upmarket district close to major economic and lifestyle hubs."
}