{
  "title": "Charming Artists' Retreat with Mountain Views, Koscielisko, Zakopane",
  "description": "Nestled at the foot of the Tatra Mountains, this unique 4-bedroom, 2-bathroom house blends modern comfort and rustic charm. Big windows frame panoramic mountain views, while the living room’s fireplace creates a true alpine ambiance. The home features a sunlit open-plan studio, a spacious fenced yard ideal for pets or creative gatherings, and sustainable energy via recently installed solar panels. Ensuite and guest bathrooms add flexibility for families and visitors.",
  "neighborhood_description": "Koscielisko is a laid-back mountain enclave just west of Zakopane, prized among artists, adventurers, and nature lovers. Enjoy a creative community, easy access to hiking trails and ski lifts, and frequent neighborhood art events. The area is expanding, with boutique cafés and studios popping up, enriched by beautifully quiet scenery but also mere moments from the highway for trips into the heart of Zakopane or Krościenko.",
  "bedrooms": 4,
  "bathrooms": 2,
  "size_sqm": 160,
  "property_type": "house",
  "city": "Zakopane",
  "neighborhood": "Koscielisko",
  "urban_level": "low",
  "transport_options": [
    "highway"
  ],
  "price": 1920000,
  "key_features": [
    "solar panels",
    "guest bathroom",
    "ensuite bathroom",
    "fenced yard",
    "fireplace",
    "open-plan studio space",
    "mountain views",
    "energy-efficient windows"
  ],
  "lifestyle_benefits": [
    "escape from city hecticness",
    "inspiring mountain scenery",
    "time for creative projects",
    "trails outside your door",
    "space to host art friends and family"
  ],
  "target_buyer": "Emerging or established creatives, artists, or remote professionals seeking inspiration and space to nurture their passions while staying connected to culture and new opportunities.",
  "market_positioning": "This property fills a rare niche in Zakopane/Koscielisko as an artist- and pet-friendly house with sustainable features and inspiring views, combining mountain serenity with direct road links to major towns. Its unique blend of modern eco-elements and distinctive style makes it an attractive and uncommon find for creative movers and shakers."
}