{
  "title": "Artistic Studio Oasis in Fenced Lazarz Retreat",
  "description": "Step inside this inspiring, sunlit studio—a perfect hideaway for creative souls. The airy, open layout features clever touches and unique nooks. An ensuite bathroom provides private comfort, and sustainable touches such as solar panels help energize your artistic pursuits. French windows overlook lush, well-maintained grounds in a fenced residential complex where pets, like creativity, are always welcome.",
  "neighborhood_description": "Situated in Poznan’s sought-after Lazarz neighborhood, this home lies at the heart of a trendy, quietly dynamic tech-oriented area. It’s nestled within walking distance of artisan cafés, hip co-working spaces, and green pockets, offering vibrance but never chaos. With efficient tram lines and dedicated bike routes nearby, inspiration—in the form of culture or community—awaits around every corner.",
  "bedrooms": 1,
  "bathrooms": 1,
  "size_sqm": 36,
  "property_type": "studio",
  "city": "Poznan",
  "neighborhood": "Lazarz",
  "urban_level": "medium",
  "transport_options": [
    "public transport",
    "bike lines"
  ],
  "price": 410000,
  "key_features": [
    "ensuite bathroom",
    "pets allowed",
    "well-maintained common areas",
    "fenced yard",
    "solar panels",
    "French windows",
    "open-plan living"
  ],
  "lifestyle_benefits": [
    "sustainable urban living",
    "neighborhood conducive to creative pursuits",
    "pet-friendly community",
    "easy public transport and bike access",
    "quiet yet trendy locale"
  ],
  "target_buyer": "Ideal for a single artist, designer, or remote-working creative who values community, sustainability, and effortless city commuting—all with the serenity of a fenced oasis.",
  "market_positioning": "Unique in offering sustainable, pet-welcoming living amidst Lazarz’s creative pulse, this home stands out for its blend of affordability and inspiring ambiance in a fast-evolving area."
}