{
  "title": "Exclusive Studio Retreat with Mountain Views in Historic Kazimierz Dolny",
  "description": "Experience refined living in this meticulously curated studio at the heart of Kazimierz Dolny's iconic Rynek. Nestled in an architecturally rejuvenated tenement, this open-plan residence offers spacious luxury, blending modern finishes with the rich cultural backdrop of the area. Underfloor heating provides year-round comfort, and built-in wardrobes maximize space and convenience. Step into a secure foyer and enjoy access to well-maintained common areas; a dedicated EV charging station connects your modern lifestyle seamlessly.",
  "neighborhood_description": "Rynek, in the enchanting Kazimierz Dolny, boasts a unique ambiance with its cobblestone squares, thriving café culture, and proximity to mountain vistas. The neighborhood is characterized by its culture-forward spirit—galleries, music festivals, and artisanal markets are steps from your door. Tranquility and charm define this low-density setting, perfect for balancing study, work, and creative pursuits.",
  "bedrooms": 1,
  "bathrooms": 1,
  "size_sqm": 36,
  "property_type": "studio",
  "city": "Kazimierz Dolny",
  "neighborhood": "Rynek",
  "urban_level": "low",
  "transport_options": [
    "highway"
  ],
  "price": 419000,
  "key_features": [
    "underfloor heating",
    "EV charging station",
    "well-maintained common areas",
    "security system",
    "built-in wardrobes"
  ],
  "lifestyle_benefits": [
    "walking distance to galleries and cafés",
    "inspiring mountain views",
    "access to cultural events",
    "quiet environment ideal for studying"
  ],
  "target_buyer": "Ideal for students seeking comfort, privacy, and a studious environment in a sophisticated, culturally vibrant destination.",
  "market_positioning": "A rare opportunity for discerning students and young professionals, this property offers an unmatched blend of style, efficiency, and security in one of Poland’s most artistic mountain towns. Its premium finish and thoughtful amenities place it above the conventional student offering, representing long-term value in Kazimierz Dolny’s coveted historic center."
}