{
  "title": "Timeless Tranquility: Artistic Family House Amid Chelm's Historic Heart",
  "description": "Elegant lines meet comforting spaces within this four-bedroom house, radiating warmth and life with every carefully crafted detail. Expansive living areas are kissed by sunlight streaming through patio doors, seamlessly leading out to a lush garden and outdoor dining terrace primed for summer evenings. Energy efficiency echoes through thoughtfully insulated walls and crisp air conditioning, while the heart of the home—the residents' lounge—offers a curated space for solace and connection. Each of the two bathrooms is tastefully modern, harmonizing functionality with pure comfort.",
  "neighborhood_description": "Located in the enchanting Dyrekcja, a neighborhood perfect for those who savor nuanced beauty and days unhurried by city bustle. Dyrekcja celebrates the pride of Chelm’s historic charm with tree-lined streets and a thriving, quietly impactful artistic community. Though tucked away from the city's center, near access to the major highway ensures the world remains at your doorstep, while you savor peaceful days inspired by creativity and heritage.",
  "bedrooms": 4,
  "bathrooms": 2,
  "size_sqm": 183,
  "property_type": "house",
  "city": "Chelm",
  "neighborhood": "Dyrekcja",
  "urban_level": "low",
  "transport_options": [
    "highway"
  ],
  "price": 1390000,
  "key_features": [
    "energy-efficient building",
    "air conditioning",
    "outdoor dining area",
    "patio doors opening to garden",
    "residents' lounge",
    "private garden"
  ],
  "lifestyle_benefits": [
    "quiet and stability for long-term living",
    "bask in a creative, artistic local community",
    "surrounded by historical architecture",
    "serene setting ideal for families and inspired minds"
  ],
  "target_buyer": "Ideal for long-term renters or families seeking lasting stability but who yearn for artistic inspiration and natural peace. Perfect for those ready to craft new memories in a lovingly maintained sanctuary, away from urban chaos.",
  "market_positioning": "Positioned as a rare treasure in Chelm for discerning renters who cherish both the romance of historical districts and the conveniences of a thoughtfully modernized home. Designed for well-rooted households tempted by Chelm's tranquil rhythm and culture."
}