{
  "title": "Historic Charmer in Ursynów – Sophisticated 5-Bedroom Family House",
  "description": "Step through the welcoming front door into a spacious, sun-warmed home where classic details blend seamlessly with modern convenience. This substantial 275 sqm family house features five elegant bedrooms and three stately bathrooms, carefully restored to highlight historical character while enhancing comfort. With a unique modern façade set amidst mature gardens and generously proportioned common areas inside, it perfectly accommodates energetic family life or tranquil retreats. Thoughtful amenities—like a dedicated laundry and laundry room, as well as ample storage—make this residence elegantly practical for daily living.",
  "neighborhood_description": "Nestled in environmentally focused Ursynów, your new home is surrounded by an eco-conscious community that cherishes green spaces and a waterside walking distance, remarkably rare within Warsaw. Recognized for its safety and accessible recreation, Ursynów curates a perfect atmosphere for a balanced lifestyle. Reliable public transport, bicycle paths, direct highway access, and close proximity to the airport ensure ease of travel whether venturing locally or afar.",
  "bedrooms": 5,
  "bathrooms": 3,
  "size_sqm": 275,
  "property_type": "house",
  "city": "Warsaw",
  "neighborhood": "Ursynów",
  "urban_level": "medium",
  "transport_options": [
    "public transport",
    "bike lines",
    "highway",
    "airport"
  ],
  "price": 1895000,
  "key_features": [
    "modern façade design",
    "restored historic details",
    "laundry room",
    "storage room",
    "spacious layout",
    "mature gardens"
  ],
  "lifestyle_benefits": [
    "eco-conscious living",
    "safe and peaceful neighborhood",
    "minimal commute time",
    "proximity to waterfront nature trails",
    "local community events"
  ],
  "target_buyer": "Young couples starting families, who value both historic charm and the practical benefits of modern design in a green Warsaw district.",
  "market_positioning": "This property stands out in Ursynów's market as a rare opportunity to enjoy historic character with all the benefits of modern design. Excellent size and thoughtful updates make it perfect for those seeking style, convenience and community-focused living."
}