{
  "title": "Artistic Pied-à-Terre with Timeless Charm in Historic Dyrekcja",
  "description": "Nestled in a distinguished historical building, this enchanting 47 sqm apartment greets you with a seamless open floor plan designed for comfort and inspiration. The spacious layout flows easily into a peaceful bedroom with soundproof walls, complemented by a modern ensuite bathroom. Convenient elevator access brings you directly to this retreat, with your own private parking space awaiting downstairs—a true rarity in such a storied neighborhood.",
  "neighborhood_description": "The Dyrekcja neighborhood in Chelm hearkens back to a quieter time, with its cultural footprint reflected in local galleries and artist studios tucked amid heritage architecture. With a low urban profile, the area feels serene, inviting those seeking creative inspiration and a bike-friendly, pet-welcoming community. Quick access to the highway makes it ideal for both staying connected and spending peaceful days at home.",
  "bedrooms": 1,
  "bathrooms": 1,
  "size_sqm": 47,
  "property_type": "apartment",
  "city": "Chelm",
  "neighborhood": "Dyrekcja",
  "urban_level": "low",
  "transport_options": [
    "highway"
  ],
  "price": 728000,
  "key_features": [
    "elevator access",
    "private parking space",
    "open floor plan",
    "ensuite bathroom",
    "soundproof walls"
  ],
  "lifestyle_benefits": [
    "inspiring ambiance for artists and creatives",
    "pet-friendly area",
    "serene environment supportive of creative pursuits",
    "secure parking for peace of mind"
  ],
  "target_buyer": "Ideally suited to artists, writers, or creative professionals searching for harmony between historic character and daily convenience, who value privacy and a cultural neighborhood vibe.",
  "market_positioning": "This apartment is a rare opportunity for creative individuals or couples to own a thoughtfully modernized, historic retreat in one of Chelm's most culturally-rooted and tranquil quarters, at an accessible entry point for the area."
}