{
  "title": "Tranquil Creative Retreat in Ustka’s Port District",
  "description": "Step into this charming three-bedroom, three-bathroom house where every corner inspires creativity. Natural hardwood floors merge elegance with comfort, while sunlight sweeps through airy common spaces perfect for work or unwinding. The ground floor offers seamless indoor-outdoor flow to a dedicated barbecue zone—ideal for evening gatherings. An underground garage provides both convenience and security.",
  "neighborhood_description": "Set within Ustka's peaceful Port District, this community-focused area boasts local shopping and dining just a bike ride away. With low urban hustle, you'll find ample space to focus and breathe, all backdropped by Baltic breezes. Enjoy easy access to the region’s highways and scenic bike lanes underpinning an active, modern lifestyle.",
  "bedrooms": 3,
  "bathrooms": 3,
  "size_sqm": 162,
  "property_type": "house",
  "city": "Ustka",
  "neighborhood": "Port District",
  "urban_level": "low",
  "transport_options": [
    "highway",
    "bike lines"
  ],
  "price": 1440000,
  "key_features": [
    "3 spacious bedrooms",
    "3 modern bathrooms",
    "hardwood floors",
    "underground garage",
    "dedicated barbecue zone",
    "light-filled open plan living spaces"
  ],
  "lifestyle_benefits": [
    "quiet for remote work",
    "steps from local amenities",
    "active biking routes",
    "private outdoor entertaining space"
  ],
  "target_buyer": "Ideal for remote working professionals or creative individuals seeking retreat-like calm yet convenient coastal living, with fast connections to road networks and a thriving community atmosphere.",
  "market_positioning": "Uniquely marrying serenity with function, this house offers rare value in Ustka’s Port District—bringing together work-friendly tranquility, outdoor dining options, and fast highway access. It stands out as a haven for those blending productivity with leisure."
}