{
  "title": "Spacious Modern Duplex with Garden Retreat in Gorna",
  "description": "Step inside this welcoming 4-bedroom, 3-bathroom duplex thoughtfully designed for family living and work-life balance. Boasting 178 sqm, this energy-efficient residence features expansive living spaces, a bright lounge for relaxing or entertaining, and patio doors leading onto a private garden—perfect for outdoor dining with loved ones. Enjoy stylish finishes throughout, generous natural light, a dedicated storage room, and the security of a private underground garage.",
  "neighborhood_description": "Situated in Gorna, one of Łódź's vibrant and storied neighborhoods, this home balances city convenience with residential tranquility. Shopping, cozy cafes, and inviting dining options are close at hand, all set amid the charming, historic surroundings for which Gorna is known. The proximity to the city’s waterfront and well-kept bike paths makes staying active and connected to nature a daily luxury.",
  "bedrooms": 4,
  "bathrooms": 3,
  "size_sqm": 178,
  "property_type": "duplex",
  "city": "Łódź",
  "neighborhood": "Górna",
  "urban_level": "medium",
  "transport_options": [
    "public transport",
    "bike lines"
  ],
  "price": 1500000,
  "key_features": [
    "residents' lounge",
    "outdoor dining area",
    "storage room",
    "energy-efficient building",
    "underground garage",
    "patio doors opening to garden"
  ],
  "lifestyle_benefits": [
    "walkable access to shops and dining",
    "historic neighborhood character",
    "enjoyment of private green space",
    "ideal work-from-home set-up",
    "balanced lifestyle with nature and urban perks"
  ],
  "target_buyer": "Entrepreneurial families seeking a harmonious space to live, play, and work. Perfect for those prioritizing comfort, eco-friendly living, and easy access to both city center and leisure opportunities.",
  "market_positioning": "A rare find for professionals or business owners in Łódź seeking spacious, move-in-ready homes with ample amenities in a desirable, central yet peaceful neighborhood."
}