{
  "title": "Eco-Modern Creative Haven with Private Garden Access in Orunia",
  "description": "This spacious 3-bedroom, 2-bathroom apartment is tailored for those with modern taste and an eco-conscious mindset. An open floor plan creates a fluid living space brilliantly lit by a modern, energy-efficient lighting system. Breath fresh air all year round thanks to the air conditioning, and enjoy seamless indoor-outdoor living as patio doors open onto your own slice of garden—perfect for unwinding or entertaining guests. Natural wood details and designer finishes sprinkle quiet luxury throughout every corner.",
  "neighborhood_description": "Nestled in the green, rising arts community of Orunia, residents benefit from abundant parkland and inspirational community spaces—making it an emerging favorite for creatives. With excellent public transport links and proximity to the highway, you stay seamlessly connected to central Gdansk while savoring a quieter, more imaginative atmosphere. Local art initiatives and eco-conscious shops enrich daily life.",
  "bedrooms": 3,
  "bathrooms": 2,
  "size_sqm": 97,
  "property_type": "apartment",
  "city": "Gdansk",
  "neighborhood": "Orunia",
  "urban_level": "medium",
  "transport_options": [
    "public transport",
    "highway"
  ],
  "price": 995000,
  "key_features": [
    "open floor plan",
    "modern lighting system",
    "air conditioning",
    "patio doors opening to garden",
    "energy-efficient appliances",
    "natural wood finishes"
  ],
  "lifestyle_benefits": [
    "private garden space",
    "green surroundings",
    "part of an artistic community",
    "transit and road connectivity",
    "environmentally friendly design elements"
  ],
  "target_buyer": "Ideal for artists, designers, and creative professionals seeking a comfortable, modern living environment nourished by an active, eco-aware community.",
  "market_positioning": "This rare Orunia apartment combines spacious, modern living with a strong connection to Gdansk’s rapidly developing creative scene—an excellent investment for buyers seeking style, community, and sustainability."
}