{
  "title": "Historic Harbor Apartment in Ustka's Port District",
  "description": "Nestled in Ustka’s famed Port District, this charming 2-bedroom apartment beautifully blends authentic period details with modern comforts. Spanning a comfortable 63 sqm, this residence offers airy, light-filled living spaces and a stylish kitchen. The bathroom, tucked away for privacy, exudes classic elegance—perfect for those seeking a unique combination of history and function. Life here is relaxed and unhurried, and residents will appreciate access to a well-maintained common area and luxury shared sauna.",
  "neighborhood_description": "Located in a low-urban, community-focused enclave, the Port District is celebrated for its historic architecture and strong cultural identity. Nearby bike lines encourage leisurely rides along the Baltic shore, while convenient highway access ensures seamless travel to and from the heart of Ustka. The area’s tranquil vibe makes it highly desirable for those craving both investment stability and cultural richness.",
  "bedrooms": 2,
  "bathrooms": 1,
  "size_sqm": 63,
  "property_type": "apartment",
  "city": "Ustka",
  "neighborhood": "Port District",
  "urban_level": "low",
  "transport_options": [
    "highway",
    "bike lines"
  ],
  "price": 734000,
  "key_features": [
    "EV charging station",
    "well-maintained common areas",
    "shared sauna",
    "classic architectural features",
    "secure storage area"
  ],
  "lifestyle_benefits": [
    "Excellent potential for short-term rental income",
    "Enjoyment of local culture and history",
    "Low density, neighborhood intimacy",
    "Quick access to cycling and driving routes"
  ],
  "target_buyer": "Ideal for property investors seeking an authentic historic asset with excellent income potential in one of Ustka’s most distinctive districts.",
  "market_positioning": "Arriving in a rare position between historic charm and lucrative prospects, this apartment presents an uncommon opportunity to own or invest in the evolving seaside pulsing with culture, ideal for both immediate returns and long-term value appreciation."
}