{
  "title": "Elegant Highland Duplex With Sweeping Mountain Views",
  "description": "An exquisite duplex nestled in the heart of Koscielisko, this five-bedroom, two-bathroom retreat is where traditional highlander charm meets modern luxury. With a spacious 198 sqm layout, each living space bathes in natural light and gazes out onto the dramatic Tatra mountains. Carefully curated interiors blend fine materials and warm textures, while broad, covered terraces offer a sublime spot for morning coffee or evening relaxation. Modern conveniences, secure entry, and personalized amenities invite you to savor a new standard of Zakopane living.",
  "neighborhood_description": "Koscielisko reveals a world where winding alpine roads meet expansive green fields. Revel in a peaceful, residential environment prized for its pristine landscapes, whispering forests, and panoramic mountaintop vistas. Blue ribbon highways are within easy reach, providing speedy routes to Zakopane town and ski resorts—so your adventures are always close at hand.",
  "bedrooms": 5,
  "bathrooms": 2,
  "size_sqm": 198,
  "property_type": "duplex",
  "city": "Zakopane",
  "neighborhood": "Koscielisko",
  "urban_level": "low",
  "transport_options": [
    "highway"
  ],
  "price": 1620000,
  "key_features": [
    "fitness center",
    "24/7 security",
    "elevator access",
    "laundry room",
    "automatic gate"
  ],
  "lifestyle_benefits": [
    "year-round mountain panoramas",
    "exclusive fitness facilities on site",
    "evening relaxation on covered balconies",
    "secure, private environment",
    "timeless design and craftsmanship"
  ],
  "target_buyer": "Sophisticated families or luxury seekers desiring tranquility, high standards, and effortless mountain access. Perfect for those who wish to reside or retreat in Poland's most scenic highland.",
  "market_positioning": "A rare, upscale property in sought-after Koscielisko—delivering prestigious mountain living with resort-level amenities and privacy. Positioned to appeal to discerning buyers seeking exclusivity and natural splendor in southern Poland."
}